// 'number' + 3 + 3 / рядок и числа- конкатенация -додавання рядочків, буде стринг 'number33'

// null + 3/ пустота прибавить 3, будет 3, т.к. Js завжди намагається привести все до числа.

// 5 && "qwerty" / qwerty - Логический оператор И (&&) (конъюнкция), повертає або ложне перше,або останне тру зліва направо, тому останне тру виводить

// +'40' + +'2' + "hillel";/ 42hillel - перетворюються в числа та складуються, а потім конкатенація со стрінгой

// '10' - 5 === 6; /false , тому що '10' - 5 буде 5 число, и оно не равно 6, навіть при двух=

// true + false/  1 , тут буде як 1+0, тому 1

// '4px' - 3/ NaN - томущо віднімаємо число из стринги, а це нічого, нот є намбер тому

// '4' - 3/ 1 ,  Js завжди намагається привести все до числа, то 4-3=1

// '6' + 3 ** 0;/ 61 , в данному прикладі конкатенация стринги та значення 3 в нулевой степені=1

// 12 / '6'/ 2, тут зводиться до чисел, тому просто розділення 

// '10' + (5 === 6);/ '10false', конкатенация стринги 10 та результату строгого порівняня false, 5 не равно 6

// null == ''/ false , і то і то false, значення неопределености та пуста строка не равни

// 3 ** (9 / 3);/ 27, правоасоціативна операція - спочатку 9 на 3 =3, потім взведення в ступень 3 в 3=27

// !!'false' == !!'true'/ true : первое двойное отрицание стринги, которая сама по сбее тру, а тут тру в итоге, и во втором тоже тру, и два тру равни друг другу

// 0 || '0' && 1 / 1, Логический оператор ИЛИ (||) (дизъюнкция) -возвращает истину -єто строка '0', затем логическое 'и' и возвращаем ложное первое или последнее тру, вот 1 последнее тру

// (+null == false) < 1; /false- спочтаку+нал=0, 0 у нас равено фолс, то це порівняння тру, а тру у нас 1, а 1 не меньше 1 , тому фолс

// false && true || true / true - логическое и - возвращает первое ложное, то есть фолс. Затем логическое или - возвращает истину - то есть идем до тру.

// false && (false || true); / false. спочатку в скобках - це в нас или, истина тру. потом и - первое ложное фолс

// (+null == false) < 1 ** 5; /false. 1 в 5 степени все равно 1. (+null == false) -це розглядалось вишче - то воно тру. а тру =1 и не менше 1, тому фолс